<template>
  <view class="agreement-wrapper">
    <view>
      <text class="u">在您注册、登录网易红彩平台、使用网易红彩平台服务（以下简称“本服务”或“网易红彩服务”）之前，<text class="b">应当仔细阅读并充分理解《网易红彩服务条款》（以下简称“本服务条款”）全部内容。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读。您确认，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力，确保有能力对您使用网易红彩服务的一切行为独立承担责任。若您不具备前述主体资格，请在您的父母或法定监护人的陪同下阅读本协议，并在取得他们对您使用本服务的行为，以及对本协议全部条款的同意之后，方可使用本服务；网易红彩在依据法律规定或本协议约定要求您承担责任时，有权向您的监护人追偿。如果您对本服务条款的任何条款表示异议，或者无法准确理解本服务条款，请不要访问和/或使用网易红彩及本服务。您的注册、登录、访问网易红彩、使用本服务等行为视为对本服务条款全部内容的接受，也意味您将接受本服务条款以及未来针对本服务条款更新版本条款的约束，并服从网易红彩的统一管理。网易红彩可能会不定期的更新本服务条款内容，您可在网易红彩软件内页或网页上查阅最新版服务条款。更新后的服务条款一旦公布即代替原来的服务条款。服务条款更新后，如您不同意接受，您应停止使用网易红彩提供的服务。</text>
      </text>
    </view>
    <view class="h3">一、服务条款的确认和接纳</view>
    <view>本服务条款是您（以下简称“用户”）与网易红彩平台（以下简称“本平台”或“网易红彩”）之间关于注册、登录网易红彩、使用网易红彩服务所订立的协议。“用户”是指注册、登录、使用网易红彩的个人。本服务的条款，内容包括条款正文、网易红彩已经发布的或将来可能发布的各类公告、规则、协议，包括但不限于《网易红彩用户购买协议》、《网易红彩VIP会员服务协议》。所有公告、规则、协议为本服务条款不可分割的组成部分，与条款正文具有同等法律效力。除另行明确声明外，用户使用本服务的行为将受本服务条款约束。
    </view>
    <view class="h3">二、网易红彩服务内容</view>
    <view>网易红彩是为广大竞彩爱好者提供足彩、篮彩等竞彩体育赛事数据分析、赛事解读、体育彩票数据分析、福利彩票数据分析的数据服务平台。 其中，网易红彩邀请关注 体育赛事、福利彩票的相关人士 （以下简称“专家”）入驻 网易红彩 ， 专家 有权在网易红彩 发布 相关个人 解读 方案（以下简称“专家解读方案”）。网易红彩的服务范围包括：专家解读方案服务、数据分析服务。</view>
    <view class="h3">三、帐号注册、登录与使用</view>
    <view>
      1、用户登录帐号名称可以是用户本人的网易邮箱帐号或网易红彩增加的其他可登录帐号。用户在使用本服务前须进行账号注册和/或登录，按照网易红彩要求提供及完善相应个人资料。用户须提供真实、及时、详尽及准确的个人资料，包括但不限于帐号名称、昵称、身份信息、头像、密码及注册或更新注册信息时输入的所有信息（以下简称“个人资料”）。如个人资料有任何变动，用户须及时在网易红彩上予以更新。
    </view>
    <view>
      2、用户在注册帐号、填写个人资料时须承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不得在个人资料中出现违法和不良信息，不得冒用、关联机构或社会名人，且用户保证其在注册和使用帐号时，不得有以下情形：
    </view>
    <view>（1）违反宪法或法律法规规定的；</view>
    <view>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</view>
    <view>（3）损害国家荣誉和利益的，损害公共利益的；</view>
    <view>（4）歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；</view>
    <view>（5）宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；</view>
    <view>（6）煽动民族仇恨、民族歧视，破坏民族团结的；</view>
    <view>（7）破坏国家宗教政策，宣扬邪教和封建迷信的；</view>
    <view>（8）散布谣言，扰乱经济秩序、社会秩序 ，破坏社会稳定的</view>
    <view>（9）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</view>
    <view>（10）侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的； ；</view>
    <view>（11）含有法律、行政法规禁止的其他内容的。</view>
    <view>
      <text class="u">
        <text class="b">3、若用户提供给 网易红彩 的 个人 资料不准确、不真实、含有违法或不良信息的，网易红彩有权不予注册并保留终止用户使用网易红彩各项服务的权利。若用户以虚假信息骗取帐号注册或帐号头像、个人简介等 个人资料存在违法和不良信息的，网易红彩有权采取通知限期改正、暂停使用、注销登记等措施。对于冒用关联机构或社会名人注册帐号名称的，网易红彩有权注销该帐号，并向政府主管部门进行报告。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">4、网易红彩账号所有权归网易红彩所有。网易红彩账号仅限于用户本人使用，禁止赠与、借用、租用、转让或售卖。如果网易红彩发现使用者并非账号初始注册人，有权不经通知收回账号而无需向账号使用人承担法律责任，由此带来的包括并不限于通讯中断、资料和虚拟财产清空等损失由用户自行承担。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">5、为使用户及时、全面了解网易红彩提供的各项服务，用户同意，网易红彩可以多次、长期向用户发送各类商业性短信息而无需另行获得用户的同意。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">6、用户同意与注册、登录、使用网易红彩帐号相关的一切资料、数据和记录，包括但不限于网易红彩帐号、个人资料、所有登录、消费记录和相关的使用统计数字等归网易红彩所有。发生争议时，用户同意以网易红彩的系统数据为准，网易红彩保证该数据的真实性。</text>
      </text>
    </view>
    <view>
      7、用户有责任妥善保管网易红彩帐号信息及帐号密码的安全，用户需要对网易红彩帐号下的行为承担法律责任。由于账号、密码等信息外借、泄露或者被他人盗用而引起的法律责任，由用户自行承担。用户同意在任何情况下不使用其他用户的帐号。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，有义务立即通告网易红彩。
    </view>
    <view>
      <text class="u">
        <text class="b">8、用户可以在使用本服务过程中，依照网易红彩规则，通过购买虚拟币“红豆”的方式进行账户充值、使用 “红豆”购买 网易红彩服务 或直接 通过网易红彩认可的支付方式购买网易红彩服务。充值、购买及使用相关事项请见《网易红彩用户购买协议》、《网易红彩VIP会员服务协议》。</text>
      </text>
    </view>
    <view class="h3">四、用户权利与义务</view>
    <view>
      <text class="u">
        <text class="b">1、用户不得以任何形式恶意注册网易红彩（包括但不限于使用技术手段反复注册、堵塞网易红彩网络通道的，或模仿网易红彩的专家昵称的行为等）。因各种形式的恶意注册而造成网易红彩的损失，网易红彩有权采取一切必要手段向用户追偿；造成的其他一切后果，由用户自行承担。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">2、用户在网易红彩查看的专家解读方案服务内容及/或数据分析服务仅供用户自己合法使用，用户不得以任何形式，有偿或无偿使第三方获得专家解读方案及/或数据分析服务的全部或部分内容。若网易红彩发现或合理怀疑用户违反上述义务，网易红彩有权采取相关措施，包括但不限于注销用户账号等，且此行为给网易红彩或其它用户造成的任何损失，网易红彩有权采取一切必要手段向用户追偿；造成的其他一切后果，由用户自行承担。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">3、用户独立承担其网易 红彩发布内容的责任。用户对本服务的使用必须遵守所有适用于服务的地方法律、国家法律和国际法律。用户承诺：</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（1）用户在网易 红彩上发布信息或者利用本服务时必须符合中国有关法律、法规、规章、政策，不得在网易红彩的网页上或者利用网易红彩服务制作、复制、发布、传播以下信息：</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（a）违反宪法或法律法规规定的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（b）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（c）损害国家荣誉和利益的，损害公共利益的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(d)歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(e)宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(f)煽动民族仇恨、民族歧视，破坏民族团结的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(g)破坏国家宗教政策，宣扬邪教和封建迷信的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（h）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（i）以非法民间组织名义活动的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(j)散布谣言，扰乱经济秩序、社会秩序，破坏社会稳定的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(k)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(l)侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（m）含有法律、行政法规禁止的其他内容的。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（2）用户不得利用网易 红彩从事制作、复制、上传、发布、传播如下内容：</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（a）含有任何性或性暗示以及任何其他低俗类信息；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（b）未经网易 红彩允许发布广告；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（c）含有任何彩票、赌博的相关信息</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">（d）侵害他人合法权益，包括但不限于名誉权、肖像权、知识产权、商业秘密、隐私权等。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(3)用户在网易 红彩上发布信息或者利用本服务时，应当采取措施，防范和抵制制作、复制、发布含有下列内容的不良信息：</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(a)使用夸张标题，内容与标题严重不符的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(b)炒作绯闻、丑闻、劣迹等的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(c)不当评述自然灾害、重大事故等灾难的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(d)带有性暗示、性挑逗等易使人产生性联想的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(e)展现血腥、惊悚、残忍等致人身心不适的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(f)煽动人群歧视、地域歧视等的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(g)宣扬低俗、庸俗、媚俗内容的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(h)可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好等的；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(i)其他对网络生态造成不良影响的内容。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(4) 为确保网易红彩和用户的利益，用户在使用网易红彩服务时，不应进行如下行为（该行为是指使用网易红彩帐户和网易红彩所进行的任何行为，包括但不限于注册登录、帐号管理及推广以及其他行为）：</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(a)强制、诱导其他用户关注、点击链接页面或分享信息；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(b)虚构事实、隐瞒真相以误导、欺骗他人；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(c)未经 网易红彩书面许可使用插件、外挂或其他第三方工具、服务接入本服务和相关系统；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(d)利用 网易红彩及网易红彩帐户从事违法犯罪活动；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(e)不得利用非法软件或其他作弊方式进行欺诈行为，也不得利用系统漏洞来获得不正当的非法利益；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(f)不得利用党旗、党徽、国旗、国徽、国歌等代表党和国家形象的标识及内容，或者借国家重大活动、重大纪念日和国家机关及其工作人员名义等，违法违规开展网络商业营销活动；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(g)不得通过发布、删除信息以及其他干预信息呈现的手段侵害他人合法权益或者谋取非法利益；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(h)不得利用深度学习、虚拟现实等新技术新应用从事法律、行政法规禁止的活动；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(i)不得通过人工方式或者技术手段实施流量造假、流量劫持以及虚假注册账号、非法交易账号、操纵用户账号等行为，破坏网络生态秩序；</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">(j) 其他以任何不合法的方式、为任何不合法的目的、或以任何与本条款不一致的方式使用、干扰本服务。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">网易红彩有权对用户发布的内容和使用本服务过程的行为在任何时间节点进行审核，若网易红彩认为用户发布的内容及 /或使用本服务过程的行为存在违法、侵权或其他违反本服务条款约定的情况，网易红彩有权不经用户事先同意即采取屏蔽、删除内容、暂停用户账号的使用、注销用户账号等措施。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">4、用户同意授予网易红彩在全世界范围内免费地、永久性地、不可撤销地使用和转授权用户通过网易红彩发布或用户使用网易红彩服务过程中形成的信息及内容（包括但不限于文字、图片、音频、视频）等，网易红彩可以通过包括但不限于使用、复制、发行、改编、汇编、传播、修改、转授权、摄制、翻译、创建衍生作品、出版、表演、放映等方式使用相关内容。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">5、若网易红彩认为用户账号内的虚拟财产（包括但不限于虚拟币等）来源异常，网易红彩有权对账号进行暂时冻结并进行调查。如调查后判定存在来源异常情形，则网易红彩有权将来源异常部分进行没收，情节严重者将进行账号封禁；来源异常情形包含但不限于：非网易红彩认可的渠道充值或购买，利用系统BUG、漏洞或外挂获得 ， 其他非正当方式来源 获得 等。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">6、用户必须为自己账号下发生的一切行为负责。用户违反本服务条款约定、或平台规范的，导致第三方向网易红彩及其关联公司、合作公司提出索赔等要求的，用户同意承担全部法律责任，包括但不限于赔偿金、罚金、和解费、诉讼仲裁费、合理的律师费支出等，并同意赔偿因此给网易红彩造成的损害。用户承担赔偿责任的方式包括但不限于根据网易红彩的书面通知向其支付与损失等额的资金、以累计的虚拟财产抵偿相关损失等。</text>
      </text>
    </view>
    <view class="h3">五、特别说明</view>
    <view>
      <text class="u">
        <text class="b">1、为免疑义，用户在此不可撤销的确认其知悉并同意如下：网易红彩所提供的服务仅限于 本服务条款第二条所列范围，网易红彩不从事彩票销售业务，也不提供彩票委托投注服务。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">2、为免疑义，网易红彩用户在此不可撤销地确认其知悉并同意专家在网易红彩平台发布的解读方案只代表专家个人观点。网易红彩对专家解读方案（包含但不限于信息的准确性和完整性）不作任何保证，且专家解读方案中的观点、结论和建议仅供参考。在任何情况下，专家解读方案中的内容或所表达的意见并不构成对任何人购买相关体育彩票、福利彩票的建议，网易红彩用户不应将该专家解读方案作为购买相关体育彩票、福利彩票的唯一参考因素，亦不应认为该专家解读方案可以取代用户自身的判断。网易红彩用户在使用本信息时，应注意甄别、慎重、正确使用该等专家解读方案，独立进行购买相关体育彩票、福利彩票的决策，防止被误导。网易红彩不对用户使用专家解读方案及其内容所引发的任何直接或间接损失负任何责任。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">3、专家解读方案所载的资料、意见及推测仅反映网易红彩于发布该信息当日、当时的判断，在不同日期或同一日期的不同时间段，网易红彩可发出与一条信息所载资料、意见及推测内容不一致的其他专家解读方案，用户应自主甄别及选用不同的专家解读方案。网易红彩不保证任何信息保持在最新状态。同时，网易红彩可在不发出通知的情况下对信息作出修改，网易红彩用户应当自行关注相应的更新或修改。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">4、为保障用户的权益，请用户不要通过其他平台或者线下接受专家的服务，也不要接受专家提供的非网易红彩约定的服务，否则由此造成的风险和损失由用户自行承担，与网易红彩无关，网易红彩并对此不承担任何责任。</text>
      </text>
    </view>
    <view class="h3">六、用户隐私制度</view>
    <view>
      <text class="u">
        <text class="b">尊重用户隐私是网易红彩的一项基本政策。网易红彩将按照网易红彩的隐私政策（https://hongcai.163.com/privacypolicy.html）收集、存储、使用、披露和保护您的个人信息。请您完整阅读上述隐私权政策，以帮助您更好地保护您的个人信息。如果您是未满14周岁的未成年人，请您通知您的父母或法定监护人共同阅读并确认我们的《网易红彩儿童个人信息保护规则及监护人须知》（https://hongcai.163.com/privacypolicychild.html），并在您使用服务、提交个人信息之前，务必寻求他们的同意和指导。</text>
      </text>
    </view>
    <view class="h3">七、知识产权</view>
    <view>
      本服务中所涉及的网易红彩图形、文字或其组成，以及其他网易红彩标志及产品、服务名称，均为本平台标识。未经本平台事先书面同意，用户不得将本平台标识以任何方式展示、使用或申请注册商标、进行域名注册等，也不得实施向他人明示或暗示有权展示、使用、或其他有权处理本平台标识的行为。用户由于非法使用本平台标识给本平台或他人造成损失的，由用户承担相关法律责任。
    </view>
    <view class="h3">八、免责声明</view>
    <view>
      <text class="u">
        <text class="b">1、用户因平台公告之系统停机维护、升级、调整，第三方原因如电信部门的通讯设备故障、计算机病毒或黑客攻击、技术问题、网络、电脑故障、系统不稳定性、台风、地震、海啸、洪水、停电、战争、恐怖袭击、政府管制及其他各种不可抗力原因而遭受的一切损失，网易红彩及其合作单位不承担责任；网易红彩对帐号上所有服务将尽力维护其安全性及方便性，但对服务中出现的信息（包括但不限于用户发布的信息）删除或储存失败不承担任何责任。因技术故障等不可抗事件影响到服务的正常运行的，网易红彩及其合作单位承诺在第一时间内与相关单位配合，及时处理进行修复，但用户因此而遭受的一切损失，网易红彩及其合作单位不承担责任。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">2、用户充分理解并同意：因业务发展需要、突发情势等，网易红彩可能会变更，暂停、限制或者终止部分或全部服务，网易红彩做出该等行为不需要事先进行通知。用户知悉并自愿承担该类风险及相关法律责任。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">3、网易红彩提供的信息内容包括但不限于：文字、软件、声音、相片、录像、图表，在广告中的全部内容，以及本平台为用户提供的商业信息。上述所有信息均受著作权法、商标法和其它知识产权法以及物权法、其他相关中国法律的保护。用户只能在本平台和合作方明确授权的情况下才能使用这些内容，不得擅自实施包括但不限于复制、修改、编纂上述内容、或创造与该内容有关的衍生产品的行为。</text>
      </text>
    </view>
    <view class="h3">九、法律</view>
    <view>
      <text class="u">
        <text class="b">1. 本服务条款适用中华人民共和国的法律，并且排除一切冲突法规定的适用。</text>
      </text>
    </view>
    <view>
      <text class="u">
        <text class="b">2. 因本服务条款引起的或与本服务条款有关的争议，网易红彩可与用户协商解决。协商不成的，用户和网易公司一致同意将纠纷提交中国国际经济贸易仲裁委员会根据其现行有效的仲裁规则进行仲裁。 仲裁地点是北京。仲裁裁决是终局的，对双方都有约束力。</text>
      </text>
    </view>
    <view class="h3">十、附则</view>
    <view>1. 网易红彩不行使、未能及时行使或者未充分行使本服务条款或者按照法律规定所享有的权利，不应被视为放弃该权利，也不影响网易红彩在将来行使该权利</view>
    <view>2. 如本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，本服务条款的其余条款仍应有效且具有约束力，网易红彩及用户均应尽力使该服务条款设定的本意得到实现。</view>
    <view>3. 本服务条款中的标题仅为方便而设，不作为解释本服务条款的依据。</view>
    <view>4. 如有任何疑问，请联系客服：【010-82558914】</view>
  </view>
</template>

<script>
export default {
}
</script>

<style lang="scss">
@import "./style/agreement.scss";
</style>
